src/main/resources/reports/stage2/put_results/wrk/wrk_put_5_poll41_with_snapshot.txt
Running 10s test @ http://localhost:8080
  1 threads and 16 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.35ms  848.80us  21.71ms   81.20%
    Req/Sec       -nan      -nan   0.00      0.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.24ms
 75.000%    1.71ms
 90.000%    2.18ms
 99.000%    4.05ms
 99.900%    9.06ms
 99.990%   17.17ms
 99.999%   20.93ms
100.000%   21.73ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.032     0.000000            1         1.00
       0.520     0.100000         9972         1.11
       0.719     0.200000        19923         1.25
       0.895     0.300000        29904         1.43
       1.068     0.400000        39884         1.67
       1.240     0.500000        49852         2.00
       1.325     0.550000        54833         2.22
       1.414     0.600000        59797         2.50
       1.506     0.650000        64772         2.86
       1.600     0.700000        69753         3.33
       1.706     0.750000        74731         4.00
       1.763     0.775000        77231         4.44
       1.825     0.800000        79707         5.00
       1.893     0.825000        82172         5.71
       1.971     0.850000        84673         6.67
       2.067     0.875000        87206         8.00
       2.121     0.887500        88402         8.89
       2.185     0.900000        89660        10.00
       2.261     0.912500        90911        11.43
       2.351     0.925000        92149        13.33
       2.463     0.937500        93388        16.00
       2.531     0.943750        94001        17.78
       2.613     0.950000        94627        20.00
       2.713     0.956250        95245        22.86
       2.833     0.962500        95870        26.67
       2.985     0.968750        96493        32.00
       3.075     0.971875        96807        35.56
       3.175     0.975000        97114        40.00
       3.293     0.978125        97425        45.71
       3.431     0.981250        97735        53.33
       3.619     0.984375        98046        64.00
       3.725     0.985938        98202        71.11
       3.839     0.987500        98358        80.00
       3.961     0.989062        98514        91.43
       4.119     0.990625        98670       106.67
       4.359     0.992188        98825       128.00
       4.515     0.992969        98902       142.22
       4.739     0.993750        98981       160.00
       4.979     0.994531        99058       182.86
       5.279     0.995313        99136       213.33
       5.691     0.996094        99213       256.00
       5.919     0.996484        99253       284.44
       6.243     0.996875        99291       320.00
       6.539     0.997266        99330       365.71
       6.935     0.997656        99369       426.67
       7.471     0.998047        99408       512.00
       7.635     0.998242        99427       568.89
       7.947     0.998437        99447       640.00
       8.271     0.998633        99468       731.43
       8.711     0.998828        99486       853.33
       9.175     0.999023        99506      1024.00
       9.383     0.999121        99515      1137.78
       9.727     0.999219        99525      1280.00
      10.007     0.999316        99534      1462.86
      10.303     0.999414        99544      1706.67
      10.543     0.999512        99554      2048.00
      10.703     0.999561        99559      2275.56
      10.983     0.999609        99564      2560.00
      11.223     0.999658        99568      2925.71
      11.487     0.999707        99573      3413.33
      11.903     0.999756        99578      4096.00
      12.423     0.999780        99581      4551.11
      13.231     0.999805        99583      5120.00
      14.295     0.999829        99585      5851.43
      15.431     0.999854        99588      6826.67
      15.767     0.999878        99590      8192.00
      17.167     0.999890        99592      9102.22
      17.199     0.999902        99593     10240.00
      17.999     0.999915        99594     11702.86
      18.495     0.999927        99595     13653.33
      18.607     0.999939        99596     16384.00
      19.407     0.999945        99597     18204.44
      19.487     0.999951        99598     20480.00
      19.487     0.999957        99598     23405.71
      19.951     0.999963        99599     27306.67
      19.951     0.999969        99599     32768.00
      20.751     0.999973        99600     36408.89
      20.751     0.999976        99600     40960.00
      20.751     0.999979        99600     46811.43
      20.927     0.999982        99601     54613.33
      20.927     0.999985        99601     65536.00
      20.927     0.999986        99601     72817.78
      20.927     0.999988        99601     81920.00
      20.927     0.999989        99601     93622.86
      21.727     0.999991        99602    109226.67
      21.727     1.000000        99602          inf
#[Mean    =        1.348, StdDeviation   =        0.849]
#[Max     =       21.712, Total count    =        99602]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  99614 requests in 10.00s, 7.03MB read
Requests/sec:   9961.74
Transfer/sec:    719.89KB