src/main/resources/reports/stage2/put_results/wrk/wrk_put_8_poll_new_close_bug.txt
Running 10s test @ http://localhost:8080
  1 threads and 16 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     0.90ms    1.76ms  46.08ms   97.38%
    Req/Sec       -nan      -nan   0.00      0.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  689.00us
 75.000%    0.94ms
 90.000%    1.09ms
 99.000%   10.69ms
 99.900%   20.99ms
 99.990%   40.03ms
 99.999%   45.15ms
100.000%   46.11ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.033     0.000000            1         1.00
       0.241     0.100000         7566         1.11
       0.333     0.200000        15147         1.25
       0.457     0.300000        22647         1.43
       0.554     0.400000        30206         1.67
       0.689     0.500000        37708         2.00
       0.743     0.550000        41517         2.22
       0.786     0.600000        45293         2.50
       0.832     0.650000        49052         2.86
       0.896     0.700000        52820         3.33
       0.944     0.750000        56601         4.00
       0.961     0.775000        58537         4.44
       0.975     0.800000        60414         5.00
       0.997     0.825000        62242         5.71
       1.026     0.850000        64142         6.67
       1.058     0.875000        66017         8.00
       1.076     0.887500        66956         8.89
       1.088     0.900000        67920        10.00
       1.098     0.912500        68889        11.43
       1.108     0.925000        69777        13.33
       1.122     0.937500        70717        16.00
       1.129     0.943750        71160        17.78
       1.139     0.950000        71629        20.00
       1.155     0.956250        72103        22.86
       1.218     0.962500        72569        26.67
       1.622     0.968750        73039        32.00
       2.109     0.971875        73275        35.56
       3.051     0.975000        73511        40.00
       4.275     0.978125        73746        45.71
       5.791     0.981250        73983        53.33
       7.467     0.984375        74217        64.00
       8.343     0.985938        74337        71.11
       9.231     0.987500        74453        80.00
      10.215     0.989062        74571        91.43
      11.111     0.990625        74689       106.67
      12.039     0.992188        74806       128.00
      12.527     0.992969        74866       142.22
      13.063     0.993750        74924       160.00
      13.567     0.994531        74983       182.86
      14.087     0.995313        75042       213.33
      14.679     0.996094        75101       256.00
      15.095     0.996484        75131       284.44
      15.503     0.996875        75160       320.00
      15.895     0.997266        75189       365.71
      16.687     0.997656        75219       426.67
      17.679     0.998047        75248       512.00
      18.239     0.998242        75263       568.89
      18.911     0.998437        75278       640.00
      19.551     0.998633        75292       731.43
      20.367     0.998828        75308       853.33
      21.119     0.999023        75322      1024.00
      21.679     0.999121        75329      1137.78
      21.999     0.999219        75337      1280.00
      22.447     0.999316        75345      1462.86
      23.183     0.999414        75351      1706.67
      23.663     0.999512        75359      2048.00
      23.935     0.999561        75362      2275.56
      24.847     0.999609        75366      2560.00
      27.007     0.999658        75370      2925.71
      29.455     0.999707        75373      3413.33
      32.399     0.999756        75377      4096.00
      33.951     0.999780        75379      4551.11
      35.455     0.999805        75381      5120.00
      36.991     0.999829        75383      5851.43
      37.599     0.999854        75384      6826.67
      39.103     0.999878        75386      8192.00
      40.031     0.999890        75387      9102.22
      40.607     0.999902        75388     10240.00
      41.535     0.999915        75389     11702.86
      42.143     0.999927        75390     13653.33
      43.071     0.999939        75391     16384.00
      43.071     0.999945        75391     18204.44
      43.647     0.999951        75392     20480.00
      43.647     0.999957        75392     23405.71
      44.575     0.999963        75393     27306.67
      44.575     0.999969        75393     32768.00
      44.575     0.999973        75393     36408.89
      45.151     0.999976        75394     40960.00
      45.151     0.999979        75394     46811.43
      45.151     0.999982        75394     54613.33
      45.151     0.999985        75394     65536.00
      45.151     0.999986        75394     72817.78
      46.111     0.999988        75395     81920.00
      46.111     1.000000        75395          inf
#[Mean    =        0.899, StdDeviation   =        1.757]
#[Max     =       46.080, Total count    =        75395]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  75403 requests in 10.00s, 5.32MB read
  Socket errors: connect 0, read 0, write 0, timeout 12
Requests/sec:   7540.49
Transfer/sec:    544.92KB